results/qwen-3.5/qwen-3.5-4b/bf16/D_reasoning.log
INFO 05-07 19:11:47 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-07 19:11:47 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe0efdcbfb1a0>, trust_remote_code=False, seed=42, num_prompts=50, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=4096, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='Qwen/Qwen3.5-4B', input_len=None, output_len=None, tokenizer='Qwen/Qwen3.5-4B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.2, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='D_reasoning.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-244681a0-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3.5-4b-bf16', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 05-07 19:11:50 [utils.py:90] Sampling input_len from [102, 1946] and output_len from [409, 7783]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.2
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 50/50 [10:30<00:00, 12.61s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Request rate configured (RPS):           0.20      
Benchmark duration (s):                  630.59    
Total input tokens:                      55522     
Total generated tokens:                  209303    
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         331.92    
Peak output token throughput (tok/s):    611.00    
Peak concurrent requests:                42.00     
Total token throughput (tok/s):          419.97    
---------------Time to First Token----------------
Mean TTFT (ms):                          347.63    
Median TTFT (ms):                        333.88    
P50 TTFT (ms):                           333.88    
P90 TTFT (ms):                           471.65    
P95 TTFT (ms):                           505.40    
P99 TTFT (ms):                           556.03    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          61.25     
Median TPOT (ms):                        61.82     
P50 TPOT (ms):                           61.82     
P90 TPOT (ms):                           66.27     
P95 TPOT (ms):                           67.31     
P99 TPOT (ms):                           69.27     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.76     
Median ITL (ms):                         61.88     
P50 ITL (ms):                            61.88     
P90 ITL (ms):                            70.83     
P95 ITL (ms):                            76.01     
P99 ITL (ms):                            130.08    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          256388.72 
Median E2EL (ms):                        251069.41 
P50 E2EL (ms):                           251069.41 
P90 E2EL (ms):                           397019.04 
P95 E2EL (ms):                           435814.44 
P99 E2EL (ms):                           447613.70 
==================================================