results/qwen-3.5/qwen-3.5-4b/bf16/J_monday-burst.log
INFO 05-07 20:36:23 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-07 20:36:23 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf04633c02b60>, trust_remote_code=False, seed=42, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4000, random_output_len=500, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=25, model='Qwen/Qwen3.5-4B', input_len=None, output_len=None, tokenizer='Qwen/Qwen3.5-4B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.5, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='J_monday-burst.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-015c23cc-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3.5-4b-bf16', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 05-07 20:36:25 [utils.py:90] Sampling input_len from [399, 7600] and output_len from [49, 950]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.5
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25
100%|██████████| 300/300 [09:25<00:00,  1.89s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Maximum request concurrency:             25        
Request rate configured (RPS):           1.50      
Benchmark duration (s):                  565.69    
Total input tokens:                      1201170   
Total generated tokens:                  150317    
Request throughput (req/s):              0.53      
Output token throughput (tok/s):         265.72    
Peak output token throughput (tok/s):    425.00    
Peak concurrent requests:                28.00     
Total token throughput (tok/s):          2389.11   
---------------Time to First Token----------------
Mean TTFT (ms):                          1176.31   
Median TTFT (ms):                        1031.83   
P50 TTFT (ms):                           1031.83   
P90 TTFT (ms):                           1757.89   
P95 TTFT (ms):                           2193.16   
P99 TTFT (ms):                           5442.49   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          88.27     
Median TPOT (ms):                        88.80     
P50 TPOT (ms):                           88.80     
P90 TPOT (ms):                           96.32     
P95 TPOT (ms):                           100.55    
P99 TPOT (ms):                           123.62    
---------------Inter-token Latency----------------
Mean ITL (ms):                           87.39     
Median ITL (ms):                         61.19     
P50 ITL (ms):                            61.19     
P90 ITL (ms):                            153.06    
P95 ITL (ms):                            348.15    
P99 ITL (ms):                            365.30    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          44921.45  
Median E2EL (ms):                        43700.02  
P50 E2EL (ms):                           43700.02  
P90 E2EL (ms):                           79782.29  
P95 E2EL (ms):                           83211.57  
P99 E2EL (ms):                           87553.77  
==================================================